xiaopaoya/JellyFrame/ports/esp32s3-idf/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_JELLYFRAME_BENCH_CARD_COUNT=40
CONFIG_JELLYFRAME_BENCH_ITERATIONS=20
CONFIG_JELLYFRAME_BENCH_VIEWPORT_WIDTH=300
CONFIG_JELLYFRAME_BENCH_VIEWPORT_HEIGHT=300
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
